---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricParamSharedFamilyKey
source: html/a3aae8d5-1a87-9165-d01f-af4e51bc9b19.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricParamSharedFamilyKey Property

"Shared family key"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricParamSharedFamilyKey { get; }
```